In [1]:
import pandas as pd

In [5]:
data = {'ID':['1','2','3','4','5'],
       'Sex':['F','F','M','M','F'],
       'Money':[1000,2000,500,300,700],
       'Name':['Saito','Horie','Kondo','Kawada','Matsubara']}
data_frame = pd.DataFrame(data)
data_frame[data_frame['Money']>500]

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
4  5   F    700  Matsubara

In [7]:
data_frame.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

In [12]:
data2 = {'ID':['3','4','7'],
        'Math':[60,30,40],
        'English':[80,20,30]}
data_frame2 = pd.DataFrame(data2)
data_frame2

  ID  Math  English
0  3    60       80
1  4    30       20
2  7    40       30

In [17]:
data_frame3 = pd.merge(data_frame, data_frame2)
data_frame3

  ID Sex  Money    Name  Math  English
0  3   M    500   Kondo    60       80
1  4   M    300  Kawada    30       20

In [20]:
data_frame3.mean()

ID          17.0
Money      400.0
Math        45.0
English     50.0
dtype: float64